index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-10 Fr 13:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>homepage</title>
<meta name="author" content="Hugs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="stylesheet.css"
</head>
<body>
<div id="preamble" class="status">
<!-- MailerLite Universal -->
<script>
    (function(w,d,e,u,f,l,n){w[f]=w[f]||function(){(w[f].q=w[f].q||[])
    .push(arguments);},l=d.createElement(e),l.async=1,l.src=u,
    n=d.getElementsByTagName(e)[0],n.parentNode.insertBefore(l,n);})
    (window,document,'script','https://assets.mailerlite.com/js/universal.js','ml');
    ml('account', '919123');
</script>
<!-- End MailerLite Universal -->
</div>
<div id="content" class="content">
<h1 class="title">homepage</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2389fdc">Neuroscience</a></li>
<li><a href="#org499cd06">Programming / software engineering</a></li>
<li><a href="#org3196048">Essays</a></li>
<li><a href="#orgcf79227">creative writing (prompts)</a></li>
</ul>
</div>
</div>
<p>
Hey there,
</p>

<p>
I'm a doctoral student in neuroscience at the EPFL in Lausanne.
I'll be using this space to write about a variety of topics to practice my writing in a low-pressure environment.
Before I was a doctoral student I worked as a programmer for a few years, and I made a lot of progress as a programmer by coding in my spare time without expectations or time pressure.
I'm hoping a blog can lead to the same advances in my writing skills.
Some of my interests on which I'll write include:
</p>
<ul class="org-ul">
<li>epistemology</li>
<li>software engineering</li>
<li>game design</li>
<li>psychology</li>
</ul>

<p>
Naturally, I'll also write a fair bit about neuroscience.
In order to keep this feeling like play rather than work I will shy away from my own topic of research (the functioning of the mouse visual cortex).
Instead, I'll branch out into other areas.
</p>

<p>
I really value simplicity and accessibility in other people's scientific writing, and want to develop that myself.
As an excercise in that I'll be aiming for a lay audience with these topics.
That's going to be a real challenge, but I do believe that each of these topics is understandable without a university degree.
If you're willing to read that hodgepodge of various content, thanks so much!
Since feedback is important to improve please leave me short reviews of the entries, what you liked, what I could improve, including which specific phrases are not clear or have a poor choice of words.
</p>

<div id="outline-container-org2389fdc" class="outline-2">
<h2 id="org2389fdc">Neuroscience</h2>
<div class="outline-text-2" id="text-org2389fdc">
<ul class="org-ul">
<li><a href="20221223134515-serotonin_and_ssris.html#ID-84c5b566-23ff-4036-9f58-8b3fcbb1b8b1">serotonin-and-ssris</a>
<ul class="org-ul">
<li><a href="20230301082812-neurotransmission_of_serotonin.html#ID-c924678f-5230-48d7-85d7-bf7413e5b2c8">neurotransmission-of-serotonin</a></li>
<li><a href="20230301083111-serotonin_and_heplessness.html#ID-02504069-e1e7-43c8-a746-43ed27a2f807">serotonin-and-heplessness</a></li>
<li><a href="20230301082956-the_serotonin_deficiency_theory.html#ID-9c8961f2-4dbd-4dc9-9cd5-f498abc8afaa">the-serotonin-deficiency-theory</a></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org499cd06" class="outline-2">
<h2 id="org499cd06">Programming / software engineering</h2>
<div class="outline-text-2" id="text-org499cd06">
<ul class="org-ul">
<li><a href="20220618121639-best_practices_for_programming.html#ID-d2494e49-8840-4773-8783-6cd586ded217">best-practices-for-programming</a></li>
</ul>
</div>
</div>


<div id="outline-container-org3196048" class="outline-2">
<h2 id="org3196048">Essays</h2>
<div class="outline-text-2" id="text-org3196048">
<ul class="org-ul">
<li><a href="20231210112406-lovecraft_and_eldritch_knowledge.html#ID-94ba5a79-0e68-48b4-b05b-826aa98ca855">lovecraft-and-eldritch-knowledge</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgcf79227" class="outline-2">
<h2 id="orgcf79227">creative writing (prompts)</h2>
<div class="outline-text-2" id="text-orgcf79227">
<p>
To help me get started with writing consistently, my sister gave me a set of creative writing prompts.
</p>

<ul class="org-ul">
<li><a href="20220617201349-tremble_and_zemble.html#ID-245d134a-80ac-4d13-a899-b52465bb36aa">tremble-and-zemble</a></li>
<li><a href="20220617202019-on_the_sonic_habits_of_terra.html#ID-b34052c5-b67a-43a7-bed1-2eaa706aaf45">on-the-sonic-habits-of-terra</a></li>
<li><a href="20220617202537-letter_from_ponder.html#ID-dd9bf4ca-f058-4d8d-9377-e1d7586c3cb1">letter-from-ponder</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="ml-embedded" data-form="UcmPfz"></div>
       <script src="https://utteranc.es/client.js"
        repo="HDictus/HDictus.github.io"
        issue-term="title"
        theme="github-light"
        crossorigin="anonymous"
        async>
      </script>

      <a href="index.html"> home </a>
</div>
</body>
</html>